test/ejabberd_tests/tsung/mam_muc.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/aleksandra.lipiec/tsung_dist/share/tsung/tsung-1.0.dtd">
<tsung loglevel="error" version="1.0" dumptraffic="false">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="100000"/>
  </clients>

  <servers>
    <server host="127.0.0.1" port="5222" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="90" unit="minute">
      <users maxnumber="5000" interarrival="0.01" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_jabber" name="global_number" value="10000"></option>
    <option type="ts_jabber" name="userid_max" value="10000"></option>
    <option type="ts_jabber" name="domain" value="localhost"></option>
    <option type="ts_jabber" name="username" value="user"></option>
    <option type="ts_jabber" name="passwd" value="pass"></option>
    <!-- full name of the MUC component -->
    <option type="ts_jabber" name="muc_service" value="muc.localhost"/>
  </options>

  <deffun name="now_to_microseconds" sourcetype="eval">
    <code>
      <![CDATA[
        fun({Mega, Secs, Micro}) ->
            (1000000 * Mega + Secs) * 1000000 + Micro
        end.
      ]]>
    </code>
  </deffun>

  <deffun name="rand_mess_id" sourcetype="eval">
    <code>
      <!-- Returns a random message id of 10 minutes age -->
      <![CDATA[
        fun() ->
            Now = now_to_microseconds(now()),
            Microseconds = Now - random:uniform(600000000),
            NodeId = random:uniform(255),
            MessId = (Microseconds bsl 8) + NodeId,
            list_to_binary(integer_to_list(MessId, 36))
        end.
      ]]>
    </code>
  </deffun>

  <sessions>
   <session bidi="true" probability="100" name="jabber-muc" type="ts_jabber">

      <request subst="true">
        <jabber type="connect" ack="no_ack"/>
      </request>

      <thinktime value="1"/>

      <transaction name="auth">
        <request><jabber type="auth_sasl" ack="local"/></request>
        <request><jabber type="connect" ack="local"/></request>
        <request><jabber type="auth_sasl_bind" ack="local"/></request>
        <request><jabber type="auth_sasl_session" ack="local"/></request>
      </transaction>

      <thinktime value="1"/>

      <request subst="true">
        <jabber type="presence:initial" ack="no_ack"/>
      </request>

      <thinktime value="5"/>

    <transaction name="roster">
      <request>
        <jabber type="iq:roster:get" ack="local"/>
      </request>
    </transaction>

    <thinktime value="10"/>
    
    <!-- choose room name and nick. -->
    <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="room"/>
    </setdynvars>

    <setdynvars sourcetype="random_string" length="10">
        <var name="nick1"/>
    </setdynvars>

    <!-- join an existing room or create a new one. -->
    <request subst="true">
      <jabber type='muc:join' ack = "local" room="room%%_room%%" nick="%%_nick1%%"/>
    </request>

    <for from="1" to="4" var="i">
      <thinktime value="15"/>
      <transaction name="online_chat">
        <request subst="true">
          <jabber type="muc:chat" ack="no_ack" size="16" room="room%%_room%%"/>
        </request>
      </transaction>

      <thinktime value="15"/>

      <!-- Querying the archive.
           Get the last page of size 10.
           -->
      <request subst="true" tag="query_last10">
        <jabber type="raw" ack="no_ack">
          <data normalize_xml="true">
            <![CDATA[
              <iq type='get' to="room%%_room%%@muc.localhost">
                <query xmlns='urn:xmpp:mam:tmp'>
                  <set xmlns='http://jabber.org/protocol/rsm'>
                    <max>10</max>
                    <before/>
                    <simple/>
                  </set>
                </query>
              </iq>
            ]]>
          </data>
        </jabber>
      </request>

      <thinktime value="5"/>

      <setdynvars sourcetype="eval" code="fun(Param) -> rand_mess_id() end.">
        <var name="random_mess_id" />
      </setdynvars>

      <request subst="true" tag="query_rand_after10">
        <jabber type="raw" ack="no_ack">
          <data normalize_xml="true">
            <![CDATA[
              <iq type='get' to="room%%_room%%@muc.localhost">
                <query xmlns='urn:xmpp:mam:tmp'>
                  <set xmlns='http://jabber.org/protocol/rsm'>
                    <max>10</max>
                    <after>%%_random_mess_id%%</after>
                    <simple/>
                  </set>
                </query>
              </iq>
            ]]>
          </data>
        </jabber>
      </request>
    </for>

  </session>
 </sessions>
</tsung>